Tekla Open API Reference for Tekla Structures 2025
SeamInputTypeAttribute Properties
The SeamInputTypeAttribute type exposes the following members.
Properties
Name | Description
Type
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
Top
See Also
Reference
SeamInputTypeAttribute Class
Tekla.Structures.Plugins Namespace